import '../../models/film_card_model.dart';

const List<FilmCardModel> films = [
  FilmCardModel(
    id: 1,
    title: 'Зеленая миля',
    voteAverage: 9.1,
    picture:
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/4057c4b8-8208-4a04-b169-26b0661453e3/300x450',
    releaseDate: '1999',
    description:
        'Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит'
        ' «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант'
        ' Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.',
    director: 'Фрэнсис Форд Коппола',
    genre: 'Драма',
  ),
  FilmCardModel(
    id: 2,
    title: 'Властелин Колец: Братство Кольца',
    voteAverage: 8.6,
    picture:
        'https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/a2d5bcae-a1a9-442f-8195-f5373a5ba77f/300x450',
    releaseDate: '2001',
    description:
        'Сказания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, '
        'получал неограниченную власть, но был обязан служить злу.',
    director: 'Питер Джексон',
    genre: 'Фантастика',
  ),
  FilmCardModel(
    id: 3,
    title: 'Пила',
    voteAverage: 7.7,
    picture:
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/7baab918-981b-4b3c-9a02-35927a7481d9/300x450',
    releaseDate: '2003',
    description:
        'Дэвид, работавший санитаром в больнице, рассказывает детективу ужасающую историю о том, как был похищен и вынужден'
        ' играть в мерзкую игру на выживание.',
    director: 'Дэвид Хакл',
    genre: 'Триллер',
  ),
  FilmCardModel(
    id: 4,
    title: 'Город Бога',
    voteAverage: 8.1,
    picture:
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/253edce8-cf8c-4045-a40b-81fc19374b00/300x450',
    releaseDate: '2002',
    description:
        'Город Бога — самая опасная фавела Рио-де-Жанейро, и именно здесь растут трое детей: Ракета, Малыш Фишка и Бенни. '
        'Поначалу они только наблюдают, как другие подростки грабят мотели и мелкие лавки, но круговорот насилия затягивает и их. '
        'Фишка — теперь Малыш Зе, главный наркоторговец и гроза всего района. Бенни — его лучший друг и правая рука,'
        ' но его тяготит криминальный образ жизни. И только Ракете удается оставаться в стороне. Он мечтает стать фотографом '
        'и становится свидетелем и собирателем хроники гангстерских разборок, утопивших Город Бога в крови.',
    director: 'Фернанду Мейреллиш, Катя Лунд',
    genre: 'Драма',
  ),
  FilmCardModel(
    id: 5,
    title: 'Форрест Гамп ',
    voteAverage: 8.9,
    picture:
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/3560b757-9b95-45ec-af8c-623972370f9d/300x450',
    releaseDate: '1994',
    description:
        'Сидя на автобусной остановке, Форрест Гамп — не очень умный, но добрый и открытый парень — рассказывает случайным'
        ' встречным историю своей необыкновенной жизни. С самого малолетства парень страдал от заболевания ног, соседские '
        'мальчишки дразнили его, но в один прекрасный день Форрест открыл в себе невероятные способности к бегу. Подруга детства'
        ' Дженни всегда его поддерживала и защищала, но вскоре дороги их разошлись.',
    director: 'Роберт Земекис',
    genre: 'Драма',
  ),
  FilmCardModel(
    id: 6,
    title: 'Престиж',
    voteAverage: 8.5,
    picture:
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1773646/0e1384ae-6367-4bba-9e5d-d91c6625371e/300x450',
    releaseDate: '2006',
    description:
        'Роберт и Альфред - фокусники-иллюзионисты, которые на рубеже XIX и XX веков соперничали друг с другом в Лондоне. '
        'С годами их дружеская конкуренция на профессиональной почве перерастает в настоящую войну. Они готовы на все, '
        'чтобы выведать друг у друга секреты фантастических трюков и сорвать их исполнение. Непримиримая вражда, '
        'вспыхнувшая между ними, начинает угрожать жизни окружающих их людей…',
    director: 'Кристофер Нолан',
    genre: 'Драма',
  ),
];
